/* 2351753 信08 黄保翔 */
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>  
#include <math.h>  

int main()
{
	double a;
	printf("请输入[0-100亿)之间的数字:\n");
	scanf("%lf", &a);
	int k;
	double d;
	k = (int)(a / 10);//缩小，没有将该数整体扩大

	printf("十亿位 :  %d \n", (int)(a / 1000000000));
	printf("亿位   :  %d \n", k % 100000000 / 10000000);
	printf("千万位 :  %d \n", k % 100000000 % 10000000 / 1000000);
	printf("百万位 :  %d \n", k % 100000000 % 10000000 % 1000000 / 100000);
	printf("十万位 :  %d \n", k % 100000000 % 10000000 % 1000000 % 100000 / 10000);
	printf("万位   :  %d \n", k % 100000000 % 10000000 % 1000000 % 100000 % 10000 / 1000);
	printf("千位   :  %d \n", k % 100000000 % 10000000 % 1000000 % 100000 % 10000 % 1000 / 100);
	printf("百位   :  %d \n", k % 100000000 % 10000000 % 1000000 % 100000 % 10000 % 1000 % 100 / 10);
	printf("十位   :  %d \n", k % 100000000 % 10000000 % 1000000 % 100000 % 10000 % 1000 % 100 % 10 / 1);
	d = a / 10 - k;
	printf ("圆     :  %d \n", (int)((int)(round(d * 1000)) / 100));//系统函数可以直接使用，包括课上未介绍过的，具体可自行查阅
	printf("角     :  %d \n", (int)((int)(round(d * 1000))) % 100 / 10);
	printf("分     :  %d \n", (int)((int)(round(d * 1000))) % 100 % 10 / 1);

	return 0;
}
